---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureURepeat
source: html/e81f15b0-bfa2-f9e3-892a-07677076f281.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureURepeat Property

The property labeled "U Repeat" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureURepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".